package com.snbc.bcvm.reportjar.common;/**
 * Created by wangfeng1 on 2018/10/18.
 */

import java.util.HashMap;
import java.util.Map;

/**
 * 作者：王峰
 * 日期：2018/10/18
 */
public class ErrorCodeList {

//   /* public static HashMap<String ,String > errorHashMap = new HashMap(){
//        {
//            put("4102","主控板与子板Info长度不符");
//            put("4103","主控板与子板CRC校验码异常");
//            put("4104","主控板与子板指令无效");
//            put("4105","主控板与子板地址不匹配");
//            put("4106","主控板与子板接收超时");
//            put("4107","参数异常");
//            put("2102","主控板与子板Info长度不符");
//            put("2103","主控板与子板CRC校验码异常");
//            put("2104","主控板与子板指令无效");
//            put("2105","主控板与子板地址不匹配");
//            put("2106","主控板与子板接收超时");
//            put("2107","参数异常");
//            put("2160","子板自检运行在BOOT");
//            put("21E0","无刷电机动作执行超时");
//            put("21E1","无刷电机过压故障");
//            put("21E2","无刷电机欠压故障");
//            put("21E3","无刷电机过热故障");
//            put("21E4","无刷电机过流故障");
//            put("21E5","无刷电机EEPROM故障");
//            put("21E6","无刷电机霍尔故障");
//            put("21E7","无刷电机霍尔故障2");
//            put("21E8","无刷电机过载");
//            put("21E9","原点传感器错误参数异常");
//            put("4202","主控板与子板Info长度不符");
//            put("4203","主控板与子板CRC校验码异常");
//            put("4204","主控板与子板指令无效");
//            put("4205","主控板与子板地址不匹配");
//            put("4206","主控板与子板接收超时");
//            put("4207","参数异常");
//            put("2202","主控板与子板Info长度不符");
//            put("2203","主控板与子板CRC校验码异常");
//            put("2204","主控板与子板指令无效");
//            put("2205","主控板与子板地址不匹配");
//            put("2206","主控板与子板接收超时");
//            put("2207","参数异常");
//            put("2260","子板自检运行在BOOT");
//            put("22E0","无刷电机动作执行超时");
//            put("22E1","无刷电机过压故障");
//            put("22E2","无刷电机欠压故障");
//            put("22E3","无刷电机过热故障");
//            put("22E4","无刷电机过流故障");
//            put("22E5","无刷电机EEPROM故障");
//            put("22E6","无刷电机霍尔故障");
//            put("22E7","无刷电机霍尔故障2");
//            put("22E8","无刷电机过载");
//            put("22E9","原点传感器错误");
//            put("4302","主控板与子板Info长度不符");
//            put("4303","主控板与子板CRC校验码异常");
//            put("4304","主控板与子板指令无效");
//            put("4305","主控板与子板地址不匹配");
//            put("4306","主控板与子板接收超时");
//            put("4307","参数异常");
//            put("2302","主控板与子板Info长度不符");
//            put("2303","主控板与子板CRC校验码异常");
//            put("2304","主控板与子板指令无效");
//            put("2305","主控板与子板地址不匹配");
//            put("2306","主控板与子板接收超时");
//            put("2307","参数异常");
//            put("2360","子板自检运行在BOOT");
//            put("23A0","取货斗入口有货");
//            put("23A3","货物超时未离开");
//            put("23A1","啮合齿轮超时未离位");
//            put("23A4","啮合齿轮超时未归位");
//            put("23B8","啮合电机堵转");
//            put("23B9","三角辊电机堵转");
//            put("23BA","翻板电机堵转");
//            put("43BA","翻板电机堵转");
//            put("43AB","翻斗打开超时未离位");
//            put("43AC","翻斗打开超时未归位");
//            put("43AD","翻斗关闭超时未离位");
//            put("43F7","翻斗关闭光幕遮挡");
//            put("43AE","翻斗关闭超时未归位");
//            put("23AB","翻斗打开超时未离位");
//            put("23AC","翻斗打开超时未归位");
//            put("23AD","翻斗关闭超时未离位");
//            put("23F7","翻斗关闭光幕遮挡");
//            put("23AE","翻斗关闭超时未归位");
//            put("23AF","初始化时啮合齿轮超时未归位");
//            put("23B7","初始化时啮合齿轮超时未离位");
//            put("23B5","初始化时翻斗超时未能离位");
//            put("23B6","初始化时翻斗超时未能归位");
//            put("63BC","激光模块异常");
//            put("4040","闸门离位超时错");
//            put("4041","闸门到位超时错");
//            put("4042","闸门打开过流错"); //   403=主控板与电源板CRC校验码异常
//            put("2040","闸门离位超时错"); // 404=主控板与电源板指令无效
//            put("2041","闸门到位超时错");//   405=主控板与电源板地址不匹配
//            put("2042","闸门打开过流错");//  406=主控板与电源板接收超时
//            put("4043","闸门离位超时错");//=参数异常
//            put("4044","闸门到位超时错");  // 460=子板自检运行在BOOT
//            put("4045","闸门关闭过流错");// 420=除霜温度传感器故障
//            put("4046","闸门关闭光幕遮挡");
//            put("2043","闸门离位超时错");
//            put("2044","闸门到位超时错");
//            put("2045","闸门关闭过流错");
//            put("2046","闸门关闭光幕遮挡");
//            put("6050","闸门销未安装");
//            put("604C","闸门削伸出离位超时");
//            put("604E","闸门削伸出到位超时");
//            put("404D","闸门削收回离位超时");
//            put("404F","闸门削收回到位超时");
//            put("204D","闸门削收回离位超时");
//            put("204F","闸门削收回到位超时");
//            put("6047","货斗销未安装");
//            put("6048","货斗削伸出离位超时");
//            put("604A","货斗削伸出到位超时");
//            put("4049","货斗削收回离位超时");
//            put("404B","货斗削收回到位超时");
//            put("2049","货斗削收回离位超时");
//            put("204B","货斗削收回到位超时");
//            put("40FA","货斗有货物");
//            put("40FD","取货仓有货");
//            put("40A2","空货道");
//            put("40B8","坏货道");
//            put("40F4","无该货道");
//            put("6030","灯箱坏");
//            put("6031","展示仓灯条1坏  ");
//            put("6032","展示仓灯条2坏  ");
//            put("6033","出货口指示灯坏");
//            put("40FB","主柜门打开");
//            put("40FC","副柜门打开");
//            put("4402","主控板与子板Info长度不符");
//            put("4403","主控板与子板CRC校验码异常");
//            put("4404","主控板与子板指令无效");
//            put("4405","主控板与子板地址不匹配");
//            put("4406","主控板与子板接收超时");
//            put("4407","参数异常");
//            put("2402","主控板与子板Info长度不符");
//            put("2403","主控板与子板CRC校验码异常");
//            put("2404","主控板与子板指令无效");
//            put("2405","主控板与子板地址不匹配");
//            put("2406","主控板与子板接收超时");
//            put("2407","参数异常");
//            put("2460","子板自检运行在BOOT");
//            put("6420","除霜温度传感器故障");
//            put("6421","箱体温度传感器故障");
//            put("6422","环境湿度传感器故障");
//            put("6423","环境温度传感器故障");
//            put("6430","压缩机组异常");
//            put("6431","加热管异常");
//        }
//    };*/

    /**
     * 作者：王峰
     * 日期：2018/10/18
     * 修改：杨铭
     * 修改时间：2019/1/17
     */
        public static Map<String ,String> errorHashMap = new HashMap(){
        {
            put("4040","闸门离位超时错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("4041","闸门到位超时错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("4042","闸门打开过流错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("2040","闸门离位超时错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("2041","闸门到位超时错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("2042","闸门打开过流错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("4043","闸门离位超时错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("4044","闸门到位超时错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("4045","闸门关闭过流错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("4046","闸门关闭光幕遮挡--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("2043","闸门离位超时错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("2044","闸门到位超时错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("2045","闸门关闭过流错--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("2046","闸门关闭光幕遮挡--进行闸门打开关闭动作，重试20次，直至错误恢复或者变为停机故障");
            put("6050","闸门销未安装--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("604C","闸门削伸出离位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("604E","闸门削伸出到位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("404D","闸门削收回离位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("404F","闸门削收回到位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("204D","闸门削收回离位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("204F","闸门削收回到位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("6047","货斗销未安装--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("6048","货斗削伸出离位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("604A","货斗削伸出到位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("4049","货斗削收回离位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("404B","货斗削收回到位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("2049","货斗削收回离位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("204B","货斗削收回到位超时--收回失败后，插销伸出、收回动作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("403F","光幕硬件错误--检测到光幕恢复，则清除错误；超过4个小时光幕扔出错，则变为停机故障");
            put("203F","光幕硬件错误--检测到光幕恢复，则清除错误；超过4个小时光幕扔出错，则变为停机故障");
            put("40FA","货斗有货物--货物拿走后清除");
            put("40FE","货仓有货物--货物拿走后清除");
            put("40A2","空货道--收到清除错误时清除错误");
            put("40FD","坏货道--收到清除错误时清除错误");
            put("40F4","无该货道--收到清除错误时清除错误");
            put("6030","灯箱坏--无法恢复，警告报错");
            put("6031","展示仓灯条1坏  --无法恢复，警告报错");
            put("6032","展示仓灯条2坏  --无法恢复，警告报错");
            put("6033","出货口指示灯坏--无法恢复，警告报错");
            put("40FB","主柜门打开--收到错误清除指令后清除错误，进入维护模式，门关闭后进行自检");
            put("40FC","副柜门打开--收到错误清除指令后清除错误，进入维护模式，门关闭后进行自检");
            put("4102","主控板与子板Info长度不符--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4103","主控板与子板CRC校验码异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4104","主控板与子板指令无效--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4105","主控板与子板地址不匹配--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4106","主控板与子板接收超时--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4107","参数异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2102","主控板与子板Info长度不符--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2103","主控板与子板CRC校验码异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2104","主控板与子板指令无效--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2105","主控板与子板地址不匹配--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2106","主控板与子板接收超时--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2107","参数异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2160","子板自检运行在BOOT--升级完成后自动检测恢复");
            put("21E0","无刷电机动作执行超时--无法恢复，停机报错");
            put("21E1","无刷电机过压故障--无法恢复，停机报错");
            put("21E2","无刷电机欠压故障--无法恢复，停机报错");
            put("21E3","无刷电机过热故障--无法恢复，停机报错");
            put("21E4","无刷电机过流故障--无法恢复，停机报错");
            put("21E5","无刷电机EEPROM故障--无法恢复，停机报错");
            put("21E6","无刷电机霍尔故障--无法恢复，停机报错");
            put("21E7","无刷电机霍尔故障2--无法恢复，停机报错");
            put("21E8","无刷电机过载--无法恢复，停机报错");
            put("21E9","原点传感器错误--无法恢复，停机报错");
            put("4202","主控板与子板Info长度不符--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4203","主控板与子板CRC校验码异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4204","主控板与子板指令无效--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4205","主控板与子板地址不匹配--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4206","主控板与子板接收超时--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4207","参数异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2202","主控板与子板Info长度不符--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2203","主控板与子板CRC校验码异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2204","主控板与子板指令无效--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2205","主控板与子板地址不匹配--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2206","主控板与子板接收超时--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2207","参数异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2260","子板自检运行在BOOT--升级完成后自动检测恢复");
            put("22E0","无刷电机动作执行超时--无法恢复，停机报错");
            put("22E1","无刷电机过压故障--无法恢复，停机报错");
            put("22E2","无刷电机欠压故障--无法恢复，停机报错");
            put("22E3","无刷电机过热故障--无法恢复，停机报错");
            put("22E4","无刷电机过流故障--无法恢复，停机报错");
            put("22E5","无刷电机EEPROM故障--无法恢复，停机报错");
            put("22E6","无刷电机霍尔故障--无法恢复，停机报错");
            put("22E7","无刷电机霍尔故障2--无法恢复，停机报错"); //   403=主控板与电源板CRC校验码异常						
            put("22E8","无刷电机过载--无法恢复，停机报错"); // 404=主控板与电源板指令无效						
            put("22E9","原点传感器错误--无法恢复，停机报错");//   405=主控板与电源板地址不匹配						
            put("4302","主控板与子板Info长度不符--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");//  406=主控板与电源板接收超时						
            put("4303","主控板与子板CRC校验码异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");//=参数异常						
            put("4304","主控板与子板指令无效--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");  // 460=子板自检运行在BOOT						
            put("4305","主控板与子板地址不匹配--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");// 420=除霜温度传感器故障						
            put("4306","主控板与子板接收超时--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4307","参数异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2302","主控板与子板Info长度不符--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2303","主控板与子板CRC校验码异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2304","主控板与子板指令无效--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2305","主控板与子板地址不匹配--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2306","主控板与子板接收超时--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2307","参数异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2360","子板自检运行在BOOT--升级完成后自动检测恢复");
            put("23A0","取货斗入口有货--无法恢复，停机报错");
            put("23A3","货物超时未离开--无法恢复，停机报错");
            put("23A1","啮合齿轮超时未离位--无法恢复，停机报错");
            put("23A4","啮合齿轮超时未归位--无法恢复，停机报错");
            put("23A5","压板探针超时未归位--进行探针伸出收回操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23A6","压板探针超时未离位--进行探针伸出收回操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23A5","压板探针超时未归位--进行探针伸出收回操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23A6","压板探针超时未离位--进行探针伸出收回操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23B8","啮合电机堵转--无法恢复，停机报错");
            put("23B9","三角辊电机堵转--无法恢复，停机报错");
            put("23BA","翻板电机堵转--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("43BA","翻板电机堵转--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("43AB","翻斗打开超时未离位--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("43AC","翻斗打开超时未归位--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("43AD","翻斗关闭超时未离位--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("43F7","翻斗关闭光幕遮挡--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("43AE","翻斗关闭超时未归位--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23AB","翻斗打开超时未离位--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23AC","翻斗打开超时未归位--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23AD","翻斗关闭超时未离位--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23F7","翻斗关闭光幕遮挡--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23AE","翻斗关闭超时未归位--进行翻板打开关闭操作正常后，重试20次，直至错误恢复或者变为停机故障");
            put("23AF","初始化时啮合齿轮超时未归位--无法恢复，停机报错");
            put("23B7","初始化时啮合齿轮超时未离位--无法恢复，停机报错");
            put("23B5","初始化时翻斗超时未能离位--无法恢复，停机报错");
            put("23B6","初始化时翻斗超时未能归位--无法恢复，停机报错");
            put("63BC","激光模块异常--无法恢复，警告报错");
            put("63BD","激光模块未安装--无法恢复，警告报错");
            put("4402","主控板与子板Info长度不符--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4403","主控板与子板CRC校验码异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4404","主控板与子板指令无效--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4405","主控板与子板地址不匹配--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4406","主控板与子板接收超时--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("4407","参数异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2402","主控板与子板Info长度不符--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2403","主控板与子板CRC校验码异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2404","主控板与子板指令无效--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2405","主控板与子板地址不匹配--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2406","主控板与子板接收超时--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2407","参数异常--进行通讯重试，最大重试20次，间隔1分钟，重试失败后变为停机故障，重试成功后恢复");
            put("2460","子板自检运行在BOOT--升级完成后自动检测恢复");
            put("6420","除霜温度传感器故障--无法恢复，警告报错");
            put("6421","箱体温度传感器故障--无法恢复，警告报错");
            put("6422","环境温湿度传感器故障--无法恢复，警告报错");
            put("6423","环境温湿度传感器故障--无法恢复，警告报错");
            put("6430","压缩机组异常--警告报错，箱体温度达到设定值后清除错误");
            put("6431","加热管异常--警告报错，箱体温度达到设定值后清除错误");
        }
        };

    public static HashMap<String ,String > soErrorHashMap = new HashMap(){
        {
            put("-99","不支持该功能--1、确认整机类型：制冷（饮料机）/非制冷/格子柜；\r\n2、查看配置文件设置：DeviceConfig.ini的type字段，1-非制冷，3-制冷，5-格子柜；");
            put("-98","设备ID错误--1、查看配置文件设置：DeviceConfig.ini的addr字段，该字段为485地址；");
            put("-97","密钥错误--//");
            put("-96","so初始化设备失败--1、确认整机类型：制冷（饮料机）/非制冷/格子柜；\r\n2、查看配置文件设置：DeviceConfig.ini的type字段，1-非制冷，3-制冷，5-格子柜；");
            put("-95","未调用初始化端口接口--重启程序");
            put("99","命令成功--//");
            put("-1000","命令失败--//");
            put("-1001","进入/退出运维模式失败--进入/退出运维模式参数错误");
            put("-1100","获取系统状态失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1101","进入维护模式失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1102","发送进入维护成功,整机未进入维护模式--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1103","货道识别指令失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1104","超时未接收到货道识别结果--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1105","货道自动识别失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1106","退出维护模式失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1107","没有货道信息--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1200","停机故障--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1201","整机忙（此次不可售卖）--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法扫描则读固件日志分析问题；\r\n");
            put("-1202","货斗有货--调用再次开门指示接口，会再次打开闸门，让客户取走货斗内的货物；");
            put("-1203","空货道--调用其他相同货物货道取货；");
            put("-1204","坏货道--调用其他相同货物货道取货；");
            put("-1205","已售空--调用其他相同货物货道取货；");
            put("-1206","已售空（品质停售）预留--调用其他相同货物货道取货；");
            put("-1207","准备中（冷却加热中）--可以售卖；");
            put("-1208","可选购（先投币）预留--预留");
            put("-1209","选购中（先选择）预留--预留");
            put("-1210","出货中 预留--预留");
            put("-1211","货道禁用--确认货道可使用，则调用货道禁用可用状态设定接口解禁；");
            put("-1212","货道层列数错--确认实际货道；");
            put("-1213","取货动作未执行--//");
            put("-1214","获取出货报告超时失败--//");
            put("-1217","取货失败，其他故障--调用错误状态获取接口，获取详细故障；");
            put("-1218","未知货物（售餐）--//");
            put("-1219","格口门已经打开（格口柜）--//");
            put("-1221","系统状态获取失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法取货则读固件日志分析问题；");
            put("-1222","错误状态获取失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法取货则读固件日志分析问题；");
            put("-1223","错误状态确认失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法取货则读固件日志分析问题；");
            put("-1224","货道状态取得失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法取货则读固件日志分析问题；");
            put("-1225","取货失败,读取故障数量为0--重新获取错误状态，判断系统整机故障");
            put("-1226","备货失败--重新备货");
            put("-1300","没有读到日志--检查通讯");
            put("-1301","读日志不完整--固件可能只有8k数据，该现象正常");
            put("-1400","读取固件升级文件大小失败--1、查看升级路径下是否存在升级文件；\r\n2、查看升级文件是否正常；");
            put("-1401","打开固件升级文件失败--1、查看升级路径下是否存在升级文件；\r\n2、查看升级文件是否正常；");
            put("-1402","读取固件升级文件内容失败--1、查看升级路径下是否存在升级文件；\r\n2、查看升级文件是否正常；");
            put("-1403","固件升级文件实际大小与文件头记录大小不一致--1、查看升级路径下是否存在升级文件；\r\n2、查看升级文件是否正常；");
            put("-1404","升级固件检测检验和CRC失败--老版本升级固件使用，新版本不再使用");
            put("-1405","查询程序更新结果超时失败--1、重新升级；\r\n2、查询版本号是否为新固件版本号，如果是则证明升级成功；");
            put("-1406","固件返回失败结果-升级文件错误--检查升级文件");
            put("-1407","参数错误--检查参数");
            put("-1408","获取系统状态失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法升级则读固件日志分析问题；");
            put("-1409","进入维护模式失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法升级则读固件日志分析问题；");
            put("-1410","程序开始升级失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法升级则读固件日志分析问题；");
            put("-1412","发送升级数据失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法升级则读固件日志分析问题；");
            put("-1413","升级文件更新失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法升级则读固件日志分析问题；");
            put("-1414","升级成功，重启失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法升级则读固件日志分析问题；");
            put("-1415","发送进入维护成功,整机未进入维护模式--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法升级则读固件日志分析问题；");
            put("-1416","固件返回失败结果-升级失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法升级则读固件日志分析问题；");
            put("-1500","停机故障--错误状态获取，判断故障");
            put("-1501","警告故障--错误状态获取，判断故障");
            put("-1502","一般故障--错误状态获取，判断故障");
            put("-1503","其他故障--错误状态获取，判断故障");
            put("-1600","获取系统状态失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法盘点则读固件日志分析问题；");
            put("-1601","进入维护模式失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法盘点则读固件日志分析问题；");
            put("-1602","发送进入维护成功,整机未进入维护模式--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法盘点则读固件日志分析问题；");
            put("-1603","下发货道厚度失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法盘点则读固件日志分析问题；");
            put("-1604","自动盘点指令失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法盘点则读固件日志分析问题；");
            put("-1605","超时未接收到盘点结果--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法盘点则读固件日志分析问题；");
            put("-1606","自动盘点识别失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法盘点则读固件日志分析问题；");
            put("-1607","自动盘点成功，盘点数据查询失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法盘点则读固件日志分析问题；");
            put("-1608","自动盘点成功，退出维护模式失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法盘点则读固件日志分析问题；");
            put("-1700","加载配置文件库及方法失败--检查配置文件库");
            put("-1701","加载配置文件库及方法失败--检查配置文件库");
            put("-1702","加载配置文件库及方法失败--检查配置文件库");
            put("-1703","加载配置文件库及方法失败--检查配置文件库");
            put("-1704","加载配置文件库及方法失败--检查配置文件库");
            put("-1705","加载配置文件库及方法失败--检查配置文件库");
            put("-1706","加载配置文件库及方法失败--检查配置文件库");
            put("-1707","获取配置文件内容失败--检查配置文件，ConfigFile.ini、DeviceConfig.ini、LogConfig.ini等，日志中会有相对文件名、字段描述");
            put("-1708","获取配置文件内容失败--检查配置文件，ConfigFile.ini、DeviceConfig.ini、LogConfig.ini等，日志中会有相对文件名、字段描述");
            put("-1709","获取配置文件内容失败--检查配置文件，ConfigFile.ini、DeviceConfig.ini、LogConfig.ini等，日志中会有相对文件名、字段描述");
            put("-1710","获取配置文件内容失败--检查配置文件，ConfigFile.ini、DeviceConfig.ini、LogConfig.ini等，日志中会有相对文件名、字段描述");
            put("-1711","获取配置文件内容失败--检查配置文件，ConfigFile.ini、DeviceConfig.ini、LogConfig.ini等，日志中会有相对文件名、字段描述");
            put("-1712","获取配置文件内容失败--检查配置文件，ConfigFile.ini、DeviceConfig.ini、LogConfig.ini等，日志中会有相对文件名、字段描述");
            put("-1713","获取配置文件内容失败--检查配置文件，ConfigFile.ini、DeviceConfig.ini、LogConfig.ini等，日志中会有相对文件名、字段描述"); //   403=主控板与电源板CRC校验码异常						
            put("-1714","获取配置文件内容失败--检查配置文件，ConfigFile.ini、DeviceConfig.ini、LogConfig.ini等，日志中会有相对文件名、字段描述"); // 404=主控板与电源板指令无效						
            put("-1715","设备类型不匹配--查看配置文件设置:DeviceConfig.ini的type字段");//   405=主控板与电源板地址不匹配						
            put("-1817","加载日志库及方法失败--检查日志库");//  406=主控板与电源板接收超时						
            put("-1818","加载日志库及方法失败--检查日志库");//=参数异常						
            put("-1819","加载日志库及方法失败--检查日志库");  // 460=子板自检运行在BOOT						
            put("-1820","加载日志库及方法失败--检查日志库");// 420=除霜温度传感器故障						
            put("-1821","加载日志库及方法失败--检查日志库");
            put("-1822","加载日志库及方法失败--检查日志库");
            put("-1823","加载日志库及方法失败--检查日志库");
            put("-1824","加载日志库及方法失败--检查日志库");
            put("-1825","加载日志库及方法失败--检查日志库");
            put("-1826","加载日志库及方法失败--检查日志库");
            put("-1827","加载日志库及方法失败--检查日志库");
            put("-1828","加载日志库及方法失败--检查日志库");
            put("-1800","初始化及记录各级别日志失败--检查so程序");
            put("-1801","初始化及记录各级别日志失败--检查so程序");
            put("-1802","初始化及记录各级别日志失败--检查so程序");
            put("-1803","初始化及记录各级别日志失败--检查so程序");
            put("-1804","初始化及记录各级别日志失败--检查so程序");
            put("-1805","初始化及记录各级别日志失败--检查so程序");
            put("-1806","初始化及记录各级别日志失败--检查so程序");
            put("-1807","初始化及记录各级别日志失败--检查so程序");
            put("-1808","初始化及记录各级别日志失败--检查so程序");
            put("-1809","初始化及记录各级别日志失败--检查so程序");
            put("-1810","初始化及记录各级别日志失败--检查so程序");
            put("-1811","初始化及记录各级别日志失败--检查so程序");
            put("-1812","初始化及记录各级别日志失败--检查so程序");
            put("-1813","初始化及记录各级别日志失败--检查so程序");
            put("-1814","初始化及记录各级别日志失败--检查so程序");
            put("-1815","初始化及记录各级别日志失败--检查so程序");
            put("-1816","初始化及记录各级别日志失败--检查so程序");
            put("-1900","打开及设置端口错误--检查配置文件端口信息");
            put("-1901","打开及设置端口错误--检查配置文件端口信息");
            put("-1902","打开及设置端口错误--检查配置文件端口信息");
            put("-1903","打开及设置端口错误--检查配置文件端口信息");
            put("-1904","打开及设置端口错误--检查配置文件端口信息");
            put("-1905","打开及设置端口错误--检查配置文件端口信息");
            put("-1906","发送失败--检查so程序");
            put("-1907","接收失败-未接收到数据--//");
            put("-1908","接收错误-端口配置错误--1、检查配置文件；\r\n2、检查通讯线缆；\r\n3、重启整机；");
            put("-1909","接收错误-没有可读写或错误的文件--1、检查配置文件；\r\n2、检查通讯线缆；\r\n3、重启整机；");
            put("-1910","接收错误-指定的文件描述符不在集合中--1、检查配置文件；\r\n2、检查通讯线缆；\r\n3、重启整机；");
            put("-1911","接收错误-接收超时--1、检查配置文件；\r\n2、检查通讯线缆；\r\n3、重启整机；");
            put("-2100","指令执行错误--检查指令");
            put("-2101","指令长度错误--检查指令");
            put("-2102","指令校验错误--检查指令");
            put("-2103","不支持指令--检查指令");
            put("-2104","指令参数错误--检查指令");
            put("-2105","固件未提供的错误--检查指令");
            put("-2106","判断帧头帧尾CMD及校验错误--检查指令");
            put("-2107","随机数读取错误--检查指令");
            put("-2108","发送485地址和接收的485地址不同--一般不会发生，so有通信锁");
            put("-2200","获取系统状态失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2201","进入维护模式失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2202","发送进入维护成功,整机未进入维护模式--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2203","光幕传感器校验指令失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2204","超时未接收到校验结果--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2300","获取系统状态失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2301","进入维护模式失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2302","发送进入维护成功,整机未进入维护模式--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2303","存在传感器校验指令失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2304","超时未接收到校验结果--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2400","获取系统状态失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2401","进入维护模式失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2402","发送进入维护成功,整机未进入维护模式--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2403","透射传感器校验指令失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-2404","超时未接收到校验结果--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-3000","获取系统状态失败--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-3001","停机故障--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-3002","整机忙（不在维护模式）--1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-3003","开格口门动作执行失败 --1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-3004","获取格口门状态超时失败 --1、查看maintainerror目录日志(或者其他错误码)，根据日志提示判断问题原因；\r\n2、查询系统状态，判断整机当前状态；\r\n3、获取错误状态，判断是否有整机故障；\r\n4、重试，再无法校验则读固件日志分析问题；");
            put("-3100","订单号长度不符32字节（新增 ）--检查格口柜下发订单号的长度 ");
        }
    };

    /**
     * @Description : 获取错误码对应信息
     * @param :
     * @return :
     */
    public static String getSoErrorInfo(String errorCode){
        return soErrorHashMap.get(errorCode);
    }
}





